YueZhengZhiYu/STM32Projects_HAL/Final/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_1_Pin GPIO_PIN_1
#define LED_1_GPIO_Port GPIOA
#define LED_2_Pin GPIO_PIN_2
#define LED_2_GPIO_Port GPIOA
#define LED_3_Pin GPIO_PIN_3
#define LED_3_GPIO_Port GPIOA
#define LED_4_Pin GPIO_PIN_4
#define LED_4_GPIO_Port GPIOA
#define TB6612_INA_1_Pin GPIO_PIN_0
#define TB6612_INA_1_GPIO_Port GPIOB
#define TB6612_INA_2_Pin GPIO_PIN_1
#define TB6612_INA_2_GPIO_Port GPIOB
#define TB6612_PWMA_Pin GPIO_PIN_10
#define TB6612_PWMA_GPIO_Port GPIOB
#define BUZZ_Pin GPIO_PIN_12
#define BUZZ_GPIO_Port GPIOB
#define Servo_PWM_Pin GPIO_PIN_8
#define Servo_PWM_GPIO_Port GPIOA
#define KEY_ADD_Pin GPIO_PIN_9
#define KEY_ADD_GPIO_Port GPIOA
#define KEY_SUB_Pin GPIO_PIN_11
#define KEY_SUB_GPIO_Port GPIOA
#define DHT_DATA_Pin GPIO_PIN_5
#define DHT_DATA_GPIO_Port GPIOB
#define ESP32_RX_Pin GPIO_PIN_6
#define ESP32_RX_GPIO_Port GPIOB
#define ESP32_TX_Pin GPIO_PIN_7
#define ESP32_TX_GPIO_Port GPIOB
#define OLED_SCL_Pin GPIO_PIN_8
#define OLED_SCL_GPIO_Port GPIOB
#define OLED_SDA_Pin GPIO_PIN_9
#define OLED_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
